app/controllers/events_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "events".* FROM "events"
SELECT "interests".* FROM "interests"  WHERE "interests"."user_id" = $1  [["user_id", 2]]
SELECT "wishlists".* FROM "wishlists"  WHERE "wishlists"."user_id" = $1  [["user_id", 2]]
SELECT "categories".* FROM "categories"
---
  def index
    @user = User.find(params[:user_id])
    event = Event.featured_events(@user.interests_ids, @user.city, @user.wishlist_ids).limit(1)[0]
    render json: {user: @user, event: event, categories: Category.all}

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "interests".* FROM "interests"  WHERE "interests"."user_id" = $1  [["user_id", 2]]
SELECT "wishlists".* FROM "wishlists"  WHERE "wishlists"."user_id" = $1  [["user_id", 2]]
---
  def list
    @user = User.find(params[:user_id])
    events = Event.featured_events(@user.interests_ids, @user.city, @user.wishlist_ids).limit(20)

SELECT "events".* FROM "events"
---
  def all
    @event = Event.all.sample