app/controllers/users_controller.rb

  def create
    @user = User.find_by(email: params[:email])
    if @user
      redirect_to user_events_path(@user)
    else
      @user = User.new(user_params)
      @user.city = 'San Francisco'
      if @user.save
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'f.martins.marques@gmail.com' LIMIT 1
INSERT INTO "users" ("city", "created_at", "email", "first_name", "image", "last_name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def edit
    get_user
    @interests = @user.interests
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def categories
    @categories = Category.all
---
SELECT "categories".* FROM "categories"