app/controllers/wishlists_controller.rb

SELECT  "events".* FROM "events"  WHERE "events"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "wishlists" ("accepted", "created_at", "event_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["accepted", "t"], ["created_at", "2015-06-22 22:05:21.157398"], ["event_id", 1], ["updated_at", "2015-06-22 22:05:21.157398"], ["user_id", 2]]
---
  def create
    accepted = to_boolean(params[:accepted])
    @event = Event.find(params[:event_id])
    @user = User.find(params[:user_id])
    @user.wishlists.create(event_id: @event.id, accepted: accepted)

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "wishlists".* FROM "wishlists"  WHERE "wishlists"."user_id" = $1 AND "wishlists"."accepted" = 't'  [["user_id", 2]]
---
  def index
    @user = User.find(params[:user_id])
    events = @user.wishlists.where(accepted: true)